[{"id":"/sicpjs/1.2","tag":"TITLE","body":"1.2  \n    \n      \n      Functions\n    \n    and the Processes They Generate"},{"tag":"TEXT","id":"#p1","child":[{"body":"\n    We have now considered the elements of programming: We have used\n    primitive arithmetic operations, we have combined these operations, and\n    we have abstracted these composite operations by \n    declaring them as compound functions.\n    But that is not enough to enable us to say that we know\n    how to program.  Our situation is analogous to that of someone who has\n    learned the rules for how the pieces move in chess but knows nothing\n    of typical openings, tactics, or strategy.  Like the novice chess\n    player, we don't yet know the common patterns of usage in the domain.\n    We lack the knowledge of which moves are worth making \n    (which functions are worth declaring).\n    We lack the experience to predict the consequences of making a move\n    (executing a function).","tag":"#text"}]},{"tag":"TEXT","id":"#p2","child":[{"body":"\n    The ability to visualize the consequences of the actions under\n    consideration is crucial to becoming an expert programmer, just as it\n    is in any synthetic, creative activity.  In becoming an expert\n    photographer, for example, one must learn how to look at a scene and\n    know how dark each region will appear on a print for each possible\n    choice of exposure and\n    processing options.\n    Only then can one reason backward, planning framing, lighting,\n    exposure, and\n    processing\n    to obtain the desired effects.  So it is with programming, where we are\n    planning the course of action to be taken by a process and where we control\n    the process by means of a program.  To become experts, we must learn to\n    visualize the processes generated by various types of\n    functions.\n    Only after we have developed such a skill can we learn\n    to reliably construct programs that exhibit the desired behavior.\n  ","tag":"#text"}]},{"tag":"TEXT","id":"#p3","child":[{"body":"\n    A\n    function \n    is a\n    \n    pattern for the ","tag":"#text"},{"tag":"EM","child":[{"body":"local evolution","tag":"#text"}]},{"body":" of a\n    computational process.  It specifies how each stage of the process is\n    built upon the previous stage.  We would like to be able to make\n    statements about the overall, or ","tag":"#text"},{"tag":"EM","child":[{"body":"global","tag":"#text"}]},{"body":", behavior of a\n    process whose local\n    \n    evolution has been specified by a \n    function.\n    This is very difficult to do in general, but we can at least try to\n    describe some typical patterns of process evolution.\n  ","tag":"#text"}]},{"tag":"TEXT","id":"#p4","child":[{"body":"\n    In this section we will examine some common \"shapes\" for\n    processes generated by simple \n    functions.\n    We will also investigate the rates at which these processes consume the\n    important computational resources of time and space. The \n    functions \n    we will consider are very simple.  Their role is like that played by test\n    patterns in photography: as oversimplified prototypical patterns, rather\n    than practical examples in their own right.\n  ","tag":"#text"}]}]