[{"id":"/sicpjs/4.2","tag":"TITLE","body":"4.2  \n    \n      \n    \n    Lazy Evaluation"},{"tag":"TEXT","id":"#p1","child":[{"body":"\n    Now that we have an evaluator expressed as a\n    JavaScript\n    program, we can experiment with alternative choices in\n    \n    language design\n    simply by modifying the evaluator.  Indeed, new languages are often\n    invented by first writing an evaluator that embeds the new language\n    within an existing high-level language.  For example, if we wish to\n    discuss some aspect of a proposed modification to\n    JavaScript\n    with another member of the\n    JavaScript\n    community, we can supply an evaluator that embodies\n    the change.  The recipient can then experiment with the new\n    evaluator and send back comments as further modifications.  Not only\n    does the high-level implementation base make it easier to test and\n    debug the evaluator; in addition, the embedding enables the designer\n    to snarf","tag":"#text"},{"tag":"FOOTNOTE_REF","id":"#footnote-link-1","body":"1","href":"/sicpjs/4.2#footnote-1"},{"body":" features\n    from the underlying language, just as our embedded\n    JavaScript\n    evaluator uses primitives and control structure from the underlying\n    JavaScript.\n    Only later (if ever) need the designer go to the trouble of building a\n    complete implementation in a low-level language or in hardware.  In\n    this section and the next we explore some variations on\n    JavaScript\n    that provide significant additional expressive power.\n  ","tag":"#text"}]},{"tag":"DISPLAYFOOTNOTE","id":"#footnote-1","count":1,"href":"/sicpjs/4.2#footnote-link-1","child":[{"body":"Snarf: \"To grab, especially a large document or\n    file for the purpose of using it either with or without the owner\"  Snarf down: \"To snarf, sometimes with the\n    connotation of absorbing, processing, or understanding.\"\n    (These definitions were\n    \n    snarfed from\n    Steele et al. 1983.  \n    See also\n    Raymond 1996.)","tag":"#text"}]}]