[{"id":"/sicpjs/prefaces03","tag":"TITLE","body":"Preface"},{"tag":"TEXT","id":"#p1","child":[{"body":"\n    The book ","tag":"#text"},{"tag":"EM","child":[{"body":"Structure and Interpretation of Computer\n    Programs","tag":"#text"}]},{"body":"\n    (SICP) introduces the reader to central ideas of\n    computation by establishing a series of mental models for computation.\n    Chapters ","tag":"#text"},{"tag":"REF","body":"1","href":"/sicpjs/1"},{"body":"–","tag":"#text"},{"tag":"REF","body":"3","href":"/sicpjs/3"},{"body":" cover programming concepts that are common to all\n    modern high-level programming languages. The original first two editions\n    of SICP use the programming language Scheme in their program examples,\n    whose minimalist, expression-oriented syntax allows the book to focus\n    on the underlying ideas rather than the design of the chosen language.\n    Chapters ","tag":"#text"},{"tag":"REF","body":"4","href":"/sicpjs/4"},{"body":" and ","tag":"#text"},{"tag":"REF","body":"5","href":"/sicpjs/5"},{"body":" use Scheme to formulate language\n    processors for Scheme, deepening the readers' understanding of the\n    mental models and exploring language extensions and alternatives.\n  ","tag":"#text"}]},{"tag":"TEXT","id":"#p2","child":[{"body":"\n    Since its publication in 1984 and its second edition in 1996, SICP has been\n    adopted as a textbook by universities and colleges around the world,\n    including the National University of Singapore (NUS), which\n    introduced the SICP-based introductory course CS1101S in 1997.\n    In the mid-1990s, the languages Python, JavaScript,\n    and Ruby emerged, which share central design elements with Scheme,\n    but which employ a more complex, statement-oriented syntax that uses\n    familiar algebraic (infix) notation. Their rise in popularity led\n    instructors to adapt their SICP-based courses, typically by\n    translating the example programs to their language of choice, by\n    adding material specific to that language, and by omitting the\n    material of chapters ","tag":"#text"},{"tag":"REF","body":"4","href":"/sicpjs/4"},{"body":" and ","tag":"#text"},{"tag":"REF","body":"5","href":"/sicpjs/5"},{"body":".\n  ","tag":"#text"}]},{"tag":"SUBHEADING","id":"#h1","child":[{"body":"Adapting SICP to JavaScript","tag":"#text"}]},{"tag":"TEXT","id":"#p3","child":[{"body":"\n    The work on adapting the second edition of SICP to JavaScript\n    \n    (SICP JS)\n    started at NUS in 2008, and CS1101S switched to JavaScript in 2012. The language\n    standard ECMAScript 2015 introduced lambda expressions, tail recursion,\n    and block-scoped variables and constants, which enabled the adaptation\n    to become quite close to the original. We made substantial changes to\n    SICP only when we felt they were forced by differences\n    between JavaScript and Scheme. The book covers just a small\n    fraction of JavaScript, so a reader would be ill-advised to use it\n    to learn the language. For example, the notion of a JavaScript\n    object—considered one of its fundamental ingredients by any\n    measure—is not even mentioned!\n  ","tag":"#text"}]},{"tag":"TEXT","id":"#p4","child":[{"body":"\n    It was straightforward to translate the programs of chapters ","tag":"#text"},{"tag":"REF","body":"1","href":"/sicpjs/1"},{"body":"–","tag":"#text"},{"tag":"REF","body":"3","href":"/sicpjs/3"},{"body":" to JavaScript by adding libraries that mirror Scheme\n    primitives—including support for list structure—and adapting the\n    text accordingly. However, the switch to JavaScript forced us to make\n    subtle changes in the interpreters and compiler of\n    chapters ","tag":"#text"},{"tag":"REF","body":"4","href":"/sicpjs/4"},{"body":" and ","tag":"#text"},{"tag":"REF","body":"5","href":"/sicpjs/5"},{"body":" in order to handle return statements.\n    Scheme's expression-oriented syntax doesn't have return statements,\n    which are a prominent feature of statement-oriented languages.\n  ","tag":"#text"}]},{"tag":"TEXT","id":"#p5","child":[{"body":"\n    By using JavaScript, chapters ","tag":"#text"},{"tag":"REF","body":"1","href":"/sicpjs/1"},{"body":"–","tag":"#text"},{"tag":"REF","body":"3","href":"/sicpjs/3"},{"body":" introduce the reader\n    to the syntactic style of most mainstream languages today.\n    However, that same syntactic style\n    gave rise to significant changes in chapter ","tag":"#text"},{"tag":"REF","body":"4","href":"/sicpjs/4"},{"body":", because\n    the direct representation of programs as data structures could\n    no longer be taken for granted. This provided us with an\n    opportunity to introduce the reader to the notion of program parsing\n    in section ","tag":"#text"},{"tag":"REF","body":"4.1","href":"/sicpjs/4.1"},{"body":",\n    an important component of programming-language processors.\n    In section ","tag":"#text"},{"tag":"REF","body":"4.4","href":"/sicpjs/4.4"},{"body":", the rigid syntactic structure of JavaScript\n    complicated the implementation of the presented logic programming system\n    and exposed the limitations of JavaScript as a tool for programming\n    language design.\n  ","tag":"#text"}]},{"tag":"SUBHEADING","id":"#h2","child":[{"body":"Resources for using SICP JS","tag":"#text"}]},{"tag":"TEXT","id":"#p6","child":[{"body":"\n    The\n    ","tag":"#text"},{"tag":"LINK","body":"MIT\n    Press web page for SICP JS","href":"https://mitpress.mit.edu/books/structure-and-interpretation-computer-programs-1"},{"body":"\n    links to support for users of this book. This provides all programs from the book\n    and extensive instructor resources, including\n    a large collection of additional exercises and\n    recommendations on selecting a subset of SICP JS that can be covered in a\n    typical college semester. The JavaScript programs in the book run in the\n    recommended strict mode in any JavaScript interpreter that complies with\n    the ECMAScript 2020 specification of JavaScript (ECMA 2020).\n    The MIT Press web page includes the JavaScript package\n    ","tag":"#text"},{"tag":"JAVASCRIPTINLINE","body":"sicp"},{"body":", which provides all JavaScript functions\n    that are considered \"","tag":"#text"},{"body":"primitive","tag":"#text"},{"body":"\" in the book.\n  ","tag":"#text"}]},{"tag":"SUBHEADING","id":"#h3","child":[{"body":"To the reader","tag":"#text"}]},{"tag":"TEXT","id":"#p7","child":[{"body":"\n    We sincerely hope that if this book is your first\n    encounter with programming you will use your newly gained understanding\n    of the structure and interpretation of computer programs to learn more\n    programming languages, including Scheme and the full JavaScript\n    language. If you have learned JavaScript prior to picking up SICP\n    JS, you might gain new insights into the fundamental concepts that underlie\n    the language and discover how much can be achieved with so little.\n    If you come to SICP JS with a knowledge of the original SICP,\n    you might enjoy seeing familiar ideas presented in a new\n    format—and might appreciate the online comparison edition,\n    available at the book's web page, where SICP JS and SICP can be viewed\n    side by side.\n  ","tag":"#text"}]},{"tag":"EPIGRAPH","child":[{}],"author":" Martin Henz and Tobias Wrigstad"}]